# Завдання: Напишіть програму на Python, яка виконує наступні дії над
# текстовим файлом input.txt:
#
# Інвертувати регістр букв: У кожному слові файлу змініть регістр букв на
# протилежний (великі букви замініть на малі і навпаки).
# Аналіз частот: Визначте частоту кожної букви (ігноруючи регістр) у файлі.
# Унікальні слова: Визначте унікальні слова у файлі, які зустрічаються більше ніж один раз.
# Запис результатів: Запишіть результати в новий файл output.txt у форматі:
# Перетворений текст (інвертований регістр).
# Частота кожної букви.
# Список унікальних слів (у порядку їх першого появи).
