"""
У нас є список показників студентів групи – це список з отриманими балами з тестування.
Необхідно поділити список на дві частини. Напишіть функцію split_list, яка приймає список
(цілі числа), знаходить середнє значення бала у списку та ділить його на два списки.
У перший потрапляють значення менше середнього, включаючи середнє значення, тоді як
у другий — строго більше від середнього. Функція повертає кортеж цих двох списків.
Для порожнього списку повертаємо два порожні списки.
"""


def split_list(grade: list):
    if not grade:
        return [], []
    grade_a, grade_b = [], []
    average = sum(grade) / len(grade)
    for gr in grade:  # gr=11 for example
        grade_a.append(gr) if gr > average else grade_b.append(gr)
    return grade_a, grade_b


print(split_list([4, 10, 11, 12, 5, 8, 10, 9]))
